foamLia/test/testCase2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
location "system";
object fvSchemes;
}

// ************************************************************************* //

ddtSchemes 
{
    default Euler;
};
gradSchemes 
{
    default Gauss linear;
};
divSchemes 
{
    default none;
    div(phi,U) Gauss upwind;
    div(phi,T) Gauss upwind;
    div(phi,k) Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,R) Gauss upwind;
    div(R) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
};
laplacianSchemes 
{
    default none;
    laplacian(nuEff,U) Gauss linear uncorrected;
    laplacian(Dp,p_rgh) Gauss linear uncorrected;
    laplacian(alphaEff,T) Gauss linear uncorrected;
    laplacian(DkEff,k) Gauss linear uncorrected;
    laplacian(DepsilonEff,epsilon) Gauss linear uncorrected;
    laplacian(DREff,R) Gauss linear uncorrected;
};
interpolationSchemes 
{
    default linear;
};
snGradSchemes 
{
    default uncorrected;
};
fluxRequired 
{
    default no;
    p_rgh ;
};

// ************************************************************************* //

